tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "liopun/brew"
tap "thezoraiz/ascii-image-converter"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Home for the Cluster Management API work, a subproject of sig-cluster-lifecycle
brew "clusterctl"
# Provides SOCKS and HTTPS proxy support to SSH
brew "connect"
# Configurable talking characters in ASCII art
brew "cowsay"
# C library implementing the SSH2 protocol
brew "libssh2"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Rainbows and unicorns in your console!
brew "lolcat"
# Fast, highly customisable system info script
brew "neofetch"
# OpenShift command-line interface tools
brew "openshift-cli"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Tool to build, change, and version infrastructure
brew "terraform"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# A convenient solution for backing up and restoring your installed packages.
brew "liopun/brew/prp"
# Convert images into ascii art
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
vscode "benjaminbenais.copilot-theme"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "coder.coder-remote"
vscode "codezombiech.gitignore"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.docker-explorer"
vscode "GitHub.copilot"
vscode "Gruntfuggly.vscode-journal-view"
vscode "hashicorp.terraform"
vscode "holmescn.vscode-wordcount-cjk"
vscode "jasonnutter.search-node-modules"
vscode "jawandarajbir.react-vscode-extension-pack"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "marp-team.marp-vscode"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-docker"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.autopep8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mushan.vscode-paste-image"
vscode "OrangeX4.better-markdown-latex-shortcuts"
vscode "OrangeX4.hsnips"
vscode "OrangeX4.latex-sympy-calculator"
vscode "OrangeX4.markdown-notes-pack"
vscode "OrangeX4.python-brackets"
vscode "pajoma.vscode-journal"
vscode "pawelgrzybek.gatito-theme"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "SharzyL.cjk-word-handler"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "SimonSiefke.svg-preview"
vscode "streetsidesoftware.code-spell-checker"
vscode "telesoho.vscode-markdown-paste-image"
vscode "vscode-icons-team.vscode-icons"
vscode "xabikos.JavaScriptSnippets"
vscode "xabikos.ReactSnippets"
vscode "yzhang.markdown-all-in-one"
